// Вычислить значение суммы s = 1+3+5+7+…+n  для заданного  нечётного n.

// let sum = 0;
// let a = 1;
// let message = +prompt('Введите конечное значение')
// while(a <= message){
//     sum+=a
//     a+=2
// }
// console.log(sum)

// Вычислить факториал числа k. k! = 1∙2∙3∙ … ∙k

// let k = 1;
// let a = 1;
// let message = +prompt('Введите конечное значение')
// while(a <= message){
//     k*=a
//     a+=1
// }
// console.log(k)

// Вычеслить сумму ряда S = 1/2 + 1/4 + 1/8 + 1/16 +... (n слагаемых)

// let s = 0;
// let i = 1;
// let a = 1/2
// let n = +prompt('Введите конечное значение')
// while(i <= n){
//     s=s + a
//     i =i + 1
//     a = a/2
// }
// console.log(s)

// Подсчитать количество цифр в записи целого положительного числа.

// let message = +prompt("Введите некое число") 
//     a = 0; 
// while (message >= 1) { 
//     message/=10; 
//     a++; 
// } 
// alert("Количество цыфр в числе: " + a);